backend.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-06 Sat 14:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Amata" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga2ba75c">1. System Design</a>
<ul>
<li><a href="#orgcde0a1a">1.1. Paper Review: Why Does the Cloud Stop Computing? Lessons from Hundreds of Service Outages</a></li>
<li><a href="#orge9ba41d">1.2. A SURVEY OF SOFTWARE FAULT TOLERANCE TECHNIQUES</a></li>
<li><a href="#orgae6f3c8">1.3. Fault Tolerant Distributed Computing</a></li>
</ul>
</li>
<li><a href="#org3010c95">2. Recovery Oriented Computing et al</a>
<ul>
<li><a href="#orgafdebdb">2.1. The Berkeley/Stanford Recovery-Oriented Computing (ROC) Project</a></li>
<li><a href="#org5827b8b">2.2. Recovery-oriented computing (wikipedia article)</a></li>
<li><a href="#org7377f84">2.3. On Designing and Deploying Internet-Scale Services by one of Amazon's Distinguished Engineers</a></li>
<li><a href="#orge4276aa">2.4. AWS Reliability Pillar (PDF) of the AWS Well-Architected Framework</a></li>
<li><a href="#orgf25b8ce">2.5. How to Build a Github talk from one of the early GitHub engineers</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga2ba75c" class="outline-2">
<h2 id="orga2ba75c"><span class="section-number-2">1</span> System Design</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcde0a1a" class="outline-3">
<h3 id="orgcde0a1a"><span class="section-number-3">1.1</span> <a href="https://muratbuffalo.blogspot.com/2016/11/why-does-cloud-stop-computing-lessons.html">Paper Review: Why Does the Cloud Stop Computing? Lessons from Hundreds of Service Outages</a></h3>
</div>
<div id="outline-container-orge9ba41d" class="outline-3">
<h3 id="orge9ba41d"><span class="section-number-3">1.2</span> <a href="https://pld.ttu.ee/IAF0030/Paper_4.pdf">A SURVEY OF SOFTWARE FAULT TOLERANCE TECHNIQUES</a></h3>
</div>
<div id="outline-container-orgae6f3c8" class="outline-3">
<h3 id="orgae6f3c8"><span class="section-number-3">1.3</span> <a href="https://crystal.uta.edu/~kumar/cse6306/papers/FaultTolerantDistComp.pdf">Fault Tolerant Distributed Computing</a></h3>
</div>
</div>
<div id="outline-container-org3010c95" class="outline-2">
<h2 id="org3010c95"><span class="section-number-2">2</span> Recovery Oriented Computing et al</h2>
<div class="outline-text-2" id="text-2">
<p>
A way to think about fault tolerance
</p>
</div>
<div id="outline-container-orgafdebdb" class="outline-3">
<h3 id="orgafdebdb"><span class="section-number-3">2.1</span> <a href="http://roc.cs.berkeley.edu/">The Berkeley/Stanford Recovery-Oriented Computing (ROC) Project</a></h3>
</div>
<div id="outline-container-org5827b8b" class="outline-3">
<h3 id="org5827b8b"><span class="section-number-3">2.2</span> <a href="https://en.wikipedia.org/wiki/Recovery-oriented_computing">Recovery-oriented computing</a> (wikipedia article)</h3>
</div>
<div id="outline-container-org7377f84" class="outline-3">
<h3 id="org7377f84"><span class="section-number-3">2.3</span> <a href="https://s3.amazonaws.com/systemsandpapers/papers/hamilton.pdf">On Designing and Deploying Internet-Scale Services</a> by one of Amazon's Distinguished Engineers</h3>
</div>
<div id="outline-container-orge4276aa" class="outline-3">
<h3 id="orge4276aa"><span class="section-number-3">2.4</span> <a href="https://docs.aws.amazon.com/wellarchitected/latest/reliability-pillar/welcome.html">AWS Reliability Pillar</a> (<a href="https://d1.awsstatic.com/whitepapers/architecture/AWS-Reliability-Pillar.pdf">PDF</a>) of the <a href="https://aws.amazon.com/architecture/well-architected/">AWS Well-Architected</a> Framework</h3>
</div>
<div id="outline-container-orgf25b8ce" class="outline-3">
<h3 id="orgf25b8ce"><span class="section-number-3">2.5</span> <a href="https://zachholman.com/talk/how-to-build-a-github/">How to Build a Github</a> talk from one of the early GitHub engineers</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Amata</p>
<p class="date">Created: 2024-01-06 Sat 14:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
